Autodesk.Revit.DB.BuiltInFailures.FabricationShapeFailures.FabricationShapeModelingError
A modeling error occurred: this happens when a modifier failed to subtract from main body

Autodesk.Revit.DB.BuiltInFailures.FabricationShapeFailures.FabricationShapeCannotGenerate
Could not generate fabrication shape

Autodesk.Revit.DB.BuiltInFailures.FabricationShapeFailures
Failures about Fabrication shape generation.